reval.org
#+title: Reval: Evaluate remote elisp code 

* Introduction
Remote eval. Ephemeral code reuse. Somewhere between load
eval, and securl then load. More auditable and stable curl pipe bash.

There are some significant drawbacks, such as remote files not being
able to resolve xrefs from remote files. It is also not clear whether
to use reval and then save the buffer to disk and the load or whether
it makes more sense to use reval to get securl and then use securl to
get the sources. Unless securl is going to be used for something else
it seems more practical to reval-into-reload, or even just reload to
get the cache benefit in addition to being able to resolve xrefs.

At the moment the serialization of the whole file is used rather than
one of the normalized prp variants. This might be added in the future,
but the objective of reval is to be small enough that it will fit in
the remaining space in the orgstrap elv it probably won't happen.

# FIXME we need some mechanism that can be used to notify/warn that a
# particular checksum version of a file is bad ... I think that having
# some way to retreive/compare to the latest version might work?  but
# if we are slurping urls from github that have an embedded hash how
# the heck can we detect and warn that the old code is bad?  this is a
# fairly big issue :/ maybe &optional latest-url ?  this is all fine
# until you have to figure out the upgrade paths for random calls to
# reval embedded in a file somewhere then it looks like a really bad
# idea ... this is another one of those things where there is a
# strange tradeoff like package managers

See [[info:elisp#Library Headers][Library Headers]] for details
related to ~reval-update~.

~reval-update~ functionality works by leveraging the builtin
functionality of ~package-buffer-info~. To create a file that
can be updated automatically by reval, use the URL: header to
point to a url that resolves to the Latest-Version of the
while it would be nice to use a Latest-Version: header directly
using URL: simplifies the implementation immensely. Note that
~pacakge-buffer-info~ only returns the first occurrence of URL:
or Homepage: so the Latest-Version url must come first. Other
urls can be listed later but will not be included in the parse.

Sadly this is not as simple as one might think. Listing the
Latest-Version url is sufficient to detect that there has been a
change, but then there is the multipath issue of how to obtain a
static url to the exact (new) version of the resource. In addition
to the Latest-Version url you need some url that either redirects
to the static latest. For example the github latest releases url
https://github.com/tgbugs/orgstrap/releases/latest has the desired
redirection behavior. The equivalent for branch refs is
https://api.github.com/repos/tgbugs/orgstrap/git/refs/heads/master.
However you have to deal with the json response there which is the
multipath issue discussed before.

Depending on how far things like git-share go, mirrors could be listed
Mirror-List: or something? If we do that then Latest-Version can be used
this is useful only after a user has been able to resolve a copy
after which a local mirrors list could be created.

| file-exists-p | checksum-match | multi | signal | elisp? | buffer   |
|---------------+----------------+-------+--------+--------+----------|
| t             | t              | t     | warn   | t      | evaled   |
| nil           | t              | t     | warn   | t      | kill     |
| t             | nil            | t     | warn   | t      | failed   |
| nil           | nil            | t     | warn   | t      | kill     |
| t             | t              | nil   | error  | t      | evaled   |
| nil           | t              | nil   | error  | t      | kill     |
| t             | nil            | nil   | error  | t      | failed   |
| nil           | nil            | nil   | error  | t      | kill     |
|---------------+----------------+-------+--------+--------+----------|
| t             | t              | t     | warn   | nil    | *failed* |
| nil           | t              | t     | warn   | nil    | kill     |
| t             | nil            | t     | warn   | nil    | failed   |
| nil           | nil            | t     | warn   | nil    | kill     |
| t             | t              | nil   | error  | nil    | *failed* |
| nil           | t              | nil   | error  | nil    | kill     |
| t             | nil            | nil   | error  | nil    | failed   |
| nil           | nil            | nil   | error  | nil    | kill     |


TODO need a way to ensure that reval maximal can run itself again on same
inputs without having to invoke again, maybe a dynamic variable in minimal?
* Notes
The general approach here is to provide a very lightweight way to get
the functionality needed for an orgstrap block into that block in a
way that allows for some level of code reuse. Thus ~reval~ should be
doing as little work as possible to get to a point where a real
package manager can take over (e.g. it is probably better to reval in
a file that can install quelpa something like that for unpublished
packages, on the other hand, the simplicity of a reval expression
means that there are fewer things that can go wrong). The minimal
~reval~ implementation pretty much has to be included in the orgstrap
block. This is unfortunate, but since I do have machinery in orgstrap
to clone blocks, it seems reasonable to have a reval minimal block
that can be used with orgstrap clone and that should be reasonably
easy to keep up to date, though hopefully also the need to do that
will be small since it should be fairly stable.

All of this to say that ~reval~ is intentionally minimal, and should
be used compositionally in expressions like the following.
#+begin_src elisp
(unless (featurep 'file) (reval 'sha256 ? "https://example.org/file.el"))
#+end_src
* Issues
** TODO Diff when updating
:PROPERTIES:
:CREATED:  [2020-11-28 Sat 22:56]
:END:
It is hard to audit a whole file every single time it is updated.
When update is called and there is an existing immutable url or a
cached version of the hash the new version should be diffed against
the existing version and the changes should be displayed for easier
review.
* reval.el
** tangles
#+begin_src elisp :noweb no-export :tangle ./reval.el :lexical yes
;;; reval.el --- Remote elisp eval. -*- lexical-binding: t -*-

;; Author: Tom Gillespie
;; Homepage: https://github.com/tgbugs/orgstrap
;; Version: 9999
;; Package-Requires: ((emacs "24.4"))
;; Is-Version-Of: https://raw.githubusercontent.com/tgbugs/orgstrap/master/reval.el
;; Reval-Get-Immutable: reval--reval-update

;;;; License and Commentary

;; License:
;; SPDX-License-Identifier: GPL-3.0-or-later

;;; Commentary:

;; reval.el implements eval of remote elisp code. More accurately
;; it implements local evaluation of remote elisp in a way that is
;; somewhat secure.

;;; Code:

<<reval-impl>>

(defun reval--reval-update ()
  "Get the immutable url for the current remote version of this file."
  (reval-get-imm-github "tgbugs" "orgstrap" "reval.el"))

(provide 'reval)

;;; reval.el ends here

#+end_src
** code
*** minimal
:PROPERTIES:
:CUSTOM_ID: minimal
:END:
This will be a common starter block for orgstrap.
#+name: reval-minimal-block
#+begin_src elisp :noweb no-export
(unless (featurep 'reval)
  (defvar reval-cache-directory (concat user-emacs-directory "reval/cache/"))
  <<reval-minimal>>
  (defalias 'reval #'reval-minimal)
  (reval ? ? "~/git/orgstrap/reval.el"))
#+end_src

A note on how reval-minimal is different from regular reval.

missing debug features and support for alternate sources
the rationale is that 99% of the time this minimal reval is going
to be used only once to open and eval a file that will also
include the full version, if that first reval fails then
something is wrong enough that users that don't have the full
version installed already are unlikely to be able to debug the
issue on their own

*BIG NOTE ON CACHING* ~reval-minimal~ by itself leaks information when
it is used. Therefore the FIRST AND LAST CALL to ~reval-minimal~
should be to retrieve and evaluate an elisp file that contains version
of ~reval~ that caches retrieved files so that network traffic cannot
be used to reveal when someone is running a file that uses ~reval~.

As much as we want to keep this simple, ~reval-minimal~ must implement
caching so that ~reval.el~ itself can be cached and make use of all
the usual machinery for updates etc. Thus we trade off a bit of
complexity in the implementation of ~reval-minimal~ for massively
reduced complexity everywhere else.

#+name: reval-minimal
#+begin_src elisp
(defun reval-minimal (cypher checksum path-or-url &rest alternates)
  "Simplified and compact implementation of reval."
  (let* ((o url-handler-mode)
         (csn (symbol-name checksum))
         (cache-path (concat reval-cache-directory (substring csn 0 2) "/" csn)))
    (url-handler-mode)
    (unwind-protect
        (cl-loop for path-or-url in (cons cache-path (cons path-or-url alternates))
                 do (when (file-exists-p path-or-url)
                      (let* ((buffer (find-file-noselect path-or-url))
                             (_ (when (string= path-or-url cache-path)
                                  (with-current-buffer buffer (emacs-lisp-mode))))
                             (buffer-checksum (intern (secure-hash cypher buffer))))
                        (if (eq buffer-checksum checksum)
                            (progn
                              (unless (string= path-or-url cache-path)
                                (let ((parent-path (file-name-directory cache-path)))
                                  (unless (file-directory-p parent-path)
                                    (make-directory parent-path t))
                                  (with-current-buffer buffer
                                    (write-file cache-path))))
                              (eval-buffer buffer))
                          (kill-buffer buffer) ; kill so cannot accidentally evaled
                          (error "reval: checksum mismatch! %s" path-or-url)))))
      (unless o
        (url-handler-mode 0)))))
#+end_src
